## Detectiong values

In [67]:
data3={
    'name':['ankit','sachin','sourav','gaurav'],
    'age':[24,np.nan,32,24],
    'profession':['sde','data','training',np.nan],
    'salary':[2000,np.nan,4000,np.nan],
    'net_worth':[3000,8000,np.nan,9000]
}

In [68]:
data3

{'name': ['ankit', 'sachin', 'sourav', 'gaurav'],
 'age': [24, nan, 32, 24],
 'profession': ['sde', 'data', 'training', nan],
 'salary': [2000, nan, 4000, nan],
 'net_worth': [3000, 8000, nan, 9000]}

In [69]:
import pandas as pd

In [70]:
df1=pd.DataFrame(data3)

In [71]:
df1.isna()

    name    age  profession  salary  net_worth
0  False  False       False   False      False
1  False   True       False    True      False
2  False  False       False   False       True
3  False  False        True    True      False

In [72]:
df1.isna().sum()

name          0
age           1
profession    1
salary        2
net_worth     1
dtype: int64

In [73]:
df1.dropna()

    name   age profession  salary  net_worth
0  ankit  24.0        sde  2000.0     3000.0

In [74]:
df1.fillna(0)

     name   age profession  salary  net_worth
0   ankit  24.0        sde  2000.0     3000.0
1  sachin   0.0       data     0.0     8000.0
2  sourav  32.0   training  4000.0        0.0
3  gaurav  24.0          0     0.0     9000.0

In [75]:
df1

     name   age profession  salary  net_worth
0   ankit  24.0        sde  2000.0     3000.0
1  sachin   NaN       data     NaN     8000.0
2  sourav  32.0   training  4000.0        NaN
3  gaurav  24.0        NaN     NaN     9000.0

In [76]:
df1['age'].mean()

np.float64(26.666666666666668)

In [81]:
df1['age'].median()

np.float64(24.0)

In [84]:
df1['age'].mode()

0    24.0
Name: age, dtype: float64

In [86]:
df1['age'].fillna(df1['age'].mean())

0    24.000000
1    26.666667
2    32.000000
3    24.000000
Name: age, dtype: float64

In [91]:
df1['age'].fillna(method='ffill')

C:\Users\HP\AppData\Local\Temp\ipykernel_14264\657531857.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df1['age'].fillna(method='ffill')

0    24.0
1    24.0
2    32.0
3    24.0
Name: age, dtype: float64

In [90]:
df1['age'].fillna(method='bfill')

C:\Users\HP\AppData\Local\Temp\ipykernel_14264\1687830601.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df1['age'].fillna(method='bfill')

0    24.0
1    32.0
2    32.0
3    24.0
Name: age, dtype: float64

In [89]:
df1

     name   age profession  salary  net_worth
0   ankit  24.0        sde  2000.0     3000.0
1  sachin   NaN       data     NaN     8000.0
2  sourav  32.0   training  4000.0        NaN
3  gaurav  24.0        NaN     NaN     9000.0